src/Documents/ВыдачаКниги/ВыдачаКниги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаКниги</name>
  <attributes>
    <name>Читатель</name>
    <type><types>CatalogRef.Читатели</types></type>
  </attributes>
  <attributes>
    <name>Библиотекарь</name>
    <type><types>CatalogRef.Сотрудники</types></type>
  </attributes>
  <attributes>
    <name>ДатаВозврата</name>
    <type><types>Date</types><dateQualifiers><dateParts>Date</dateParts></dateQualifiers></type>
  </attributes>
  <registerRecords>AccumulationRegister.КнигиНаРуках</registerRecords>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type><types>CatalogRef.Книги</types></type>
    </attributes>
    <attributes>
      <name>КодЭкземпляра</name>
      <type><types>String</types><stringQualifiers><length>20</length></stringQualifiers></type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/КнигиНаРуках/КнигиНаРуках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КнигиНаРуках</name>
  <registerType>Balance</registerType>
  <dimensions>
    <name>Читатель</name>
    <type><types>CatalogRef.Читатели</types></type>
  </dimensions>
  <dimensions>
    <name>Книга</name>
    <type><types>CatalogRef.Книги</types></type>
  </dimensions>
  <dimensions>
    <name>КодЭкземпляра</name>
    <type><types>String</types><stringQualifiers><length>20</length></stringQualifiers></type>
  </dimensions>
  <resources>
    <name>Количество</name>
    <type><types>Number</types><numberQualifiers><precision>5</precision></numberQualifiers></type>
  </resources>
  <attributes>
    <name>ДатаВозврата</name>
    <type><types>Date</types><dateQualifiers><dateParts>Date</dateParts></dateQualifiers></type>
  </attributes>
</mdclass:AccumulationRegister>

src/InformationRegisters/ИсторияВыдач/ИсторияВыдач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияВыдач</name>
  <periodicity>Nonperiodical</periodicity>
  <writeMode>Independent</writeMode>
  <dimensions>
    <name>Читатель</name>
    <type><types>CatalogRef.Читатели</types></type>
  </dimensions>
  <dimensions>
    <name>КодЭкземпляра</name>
    <type><types>String</types><stringQualifiers><length>20</length></stringQualifiers></type>
  </dimensions>
  <dimensions>
    <name>ДатаВыдачи</name>
    <type><types>Date</types><dateQualifiers><dateParts>Date</dateParts></dateQualifiers></type>
  </dimensions>
  <resources>
    <name>Книга</name>
    <type><types>CatalogRef.Книги</types></type>
  </resources>
  <attributes>
    <name>ДатаВозврата</name>
    <type><types>Date</types><dateQualifiers><dateParts>Date</dateParts></dateQualifiers></type>
  </attributes>
  <attributes>
    <name>ФактДатаВозврата</name>
    <type><types>Date</types><dateQualifiers><dateParts>Date</dateParts></dateQualifiers></type>
  </attributes>
</mdclass:InformationRegister>

src/Documents/ВыдачаКниги/ObjectModule.bsl
// @strict-types

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	КатЧитателя = Читатель.Категория;
	МаксКниг    = КатЧитателя.МаксКнигНаРуках;

	Если МаксКниг > 0 Тогда

		ЗапросЛимит = Новый Запрос;
		ЗапросЛимит.Текст =
		"ВЫБРАТЬ
		|	СУММА(КнигиНаРуках.КоличествоОстаток) КАК КоличествоНаРуках
		|ИЗ
		|	РегистрНакопления.КнигиНаРуках.Остатки(, Читатель = &Читатель) КАК КнигиНаРуках";
		ЗапросЛимит.УстановитьПараметр("Читатель", Читатель);
		РезЛимит = ЗапросЛимит.Выполнить().Выгрузить();

		ТекКол = 0;
		Если РезЛимит.Количество() > 0 И НЕ РезЛимит[0].КоличествоНаРуках = Null Тогда
			ТекКол = РезЛимит[0].КоличествоНаРуках;
		КонецЕсли;

		Если ТекКол + Книги.Количество() > МаксКниг Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Читатель превысит лимит (%1 кн.). На руках: %2, добавляется: %3.",
				МаксКниг, ТекКол, Книги.Количество());
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;

	КонецЕсли;

	// Движения по регистру накопления КнигиНаРуках
	Движения.КнигиНаРуках.Записывать = Истина;

	Для Каждого Строка Из Книги Цикл

		Движение = Движения.КнигиНаРуках.Добавить();
		Движение.ВидДвижения   = ВидДвиженияНакопления.Приход;
		Движение.Период        = Дата;
		Движение.Читатель      = Читатель;
		Движение.Книга         = Строка.Книга;
		Движение.КодЭкземпляра = Строка.КодЭкземпляра;
		Движение.Количество    = 1;
		Движение.ДатаВозврата  = ДатаВозврата;

	КонецЦикла;

	// Прямая запись в регистр сведений ИсторияВыдач
	Для Каждого Строка Из Книги Цикл

		НаборЗаписей = РегистрыСведений.ИсторияВыдач.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Читатель.Установить(Читатель);
		НаборЗаписей.Отбор.КодЭкземпляра.Установить(Строка.КодЭкземпляра);
		НаборЗаписей.Отбор.ДатаВыдачи.Установить(Дата);

		ЗаписьИст = НаборЗаписей.Добавить();
		ЗаписьИст.Читатель      = Читатель;
		ЗаписьИст.КодЭкземпляра = Строка.КодЭкземпляра;
		ЗаписьИст.ДатаВыдачи    = Дата;
		ЗаписьИст.Книга         = Строка.Книга;
		ЗаписьИст.ДатаВозврата  = ДатаВозврата;

		НаборЗаписей.Записать();

	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	Движения.КнигиНаРуках.Записывать = Истина;

КонецПроцедуры

#КонецОбласти
